NoName2/Main.yml
config:
  target: "https://komscoverse.kro.kr"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 3
      arrivalRate: 100
      rampTo: 100
      name: Warm up phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
    - flow:
      - post:
          url: "/app/auth/usersignin"
          capture:
            - json: "$"
              as: response
      - get:
          url: "/app/auth/admin-control"
          headers:
            sessionToken: "{{response._sessionToken}}"
          capture:
            - json: "$"
              as: data_response
      - log: "{{data_response}}"